// var stringSimilarity = require('string-similarity')

// // let str1 = '嘟嘟嘟  嗯。|你好，|唉，你好，麻烦问这事，|您说|谁知怎么看行不行了，|喂你好。呀|唉哟|能听清楚了吧，|唉唉我想说一下我，|我理解省。|我不知道你是谁，你先说你什么事情好吗？|唉我这个多少钱不是说那个无不对，本栏目什么都瞎掰，从七点钟然后到下面显示模式就是不对，啊|我没有|麻烦你，我看这平台上看一下。|你是哪的？呀。|朝阳区的|会|河源那头灯区。|叫什么？|李先生。|谁知。|囡。|今天做了多少了？|今天我感觉不低于30亩地了，现在想这次目的啊|七点钟37点，|好像是7点一刻你会干的活吧，|我现在没在现场，知道吧？|我不知道你现在有没有在现场，我是说你现在是不是还在作业这个车。|作业，家里人没停。|你作业没醒，现在这个魔术不是实时上传的，你是在微信上查的是吧？|对对对对。|你在微信上查了你刚登录上去的时候不是有一个红色的提示信息吗？看了吗？明天毕业的时候这个不会时尚台等你做完一这快D做完之后他这个魔术才会上传，|你现在还做作业，呢肯定这块地是不往上传的。|我为什么打电话？啊昨天就是因为这个情况，你这边有问题吗？|啊对啊。|对呀昨天设备有问题。啊。|整个非常high起来，|应该各位没问题，吧今天我怕他别再出现问题，我怕这个光捣乱。嘛呢。|不会你刷新一下，我现在刚登上你这个微信，你现在选这个是39。|啊那么就这样，我刚才显示14点多，啊谢谢！|啊。|没事，现在这块地做完之后，他这个劲嗯才会上传，不是说你一边做着一边上传。他现在这个车还正在作业，呢|没有情景，所以说它现在包括它现在做的这块地，如果说跟它之前还有D两者那它这些事都不上传的。|嗯昨天号|嗯因为多了这个我害怕了，啊唉这样啊。|噢你让基础这边作业的时候看着点就行，你让它作业的时候对的时候怎么样算正常，它那个不是有那个提示的那个章，嘛你让它自己让，司机也看着点，别看干活就|干活，就是干活呢也不看着，那个那本来就是一个故障趋势的一个对吧。|好，这个情况我跟那个司机已经交代清楚了，|因为昨天我也相信我们，没想到机器出现故障，|昨天也是等到下午才发现这个问题，|所以说我现在胖了，看到了。|噢那个没事赶紧去掉的话，但有故障的话那个都会有提示的，咱这边都不给自己，让自己听的人真的别睡着，别作业的时候就是作业呢也不看这个，我就哐哐哐开始做。|啊行，|我我就再交代一下，唉麻烦你了啊|就是这样，|嗯嗯再见。|嗯。|OK。|请您对我们的服务进行评价，非常满意，请按一买，感谢您的参与再见。'
// // let str2 = '你好，麻烦问这事，|您说啊|怎么看行不行了，|喂你好。呀|'
// var similarity = stringSimilarity.compareTwoStrings(str1.substr(0, str2.length), str2)
// // // var matches = stringSimilarity.findBestMatch('healed', ['edward', 'sealed', 'theatre'])

// console.log('similarity', similarity)


// const path = require('path')
// let fileName = '4000866820_18665681399_01053948015_843780676061_20171101090832.wav.mp3'
// let filePath = `http://processed-wav-dev-uswest.oss-us-west-1.aliyuncs.com/Youyin-test-Nov28/${fileName}`
// console.log('path.basename(filePath)', path.basename(filePath))

const fs = require('fs')
fs.appendFile('unmatchedAudio.txt', `test\n`, function (err) {
  if (err) throw err
})

