let dubo = ['赌博', '下注', '投注', '买码', '赌码', '赌球', '百家乐', '老虎机', '彩票', '洗码', '棋牌对弈', '真人娱乐']

let seqing = ['按摩', '洗浴', '技师', '年龄', '陪聊', '特色服务', '服务套餐', '上门服务', 'SM', '成人快播', '制服']

let zhapian = ['网银转账', '验证码', '机票改签', '退票', 'ATM', '银行卡号', '民航官网', '改签系统', '余额']

let weigui = ['代孕']

let qita = ['入金', '出金', '提现不到账', '起诉', '账户', '中奖', '公安局', '检察院', '法院', '代孕', '国际警察', '保密', '资产冻结', '贩毒']

let temp = [ '支付宝', '会员', '提现', '微信', '充值', '退款', '冻结' ]

let removed = ['诈骗', '岁', '色情']

let toBeAdded = ['冻结']

module.exports = [].concat(dubo, seqing, zhapian, weigui, qita, temp)
